app/Controllers/Barangkeluar.php

    public function cektransaksi($faktur)
    {
        $modelBarangKeluar = new ModelBarangKeluar();
        $cekData = $modelBarangKeluar->find($faktur);
---
SELECT *
FROM `barangkeluar`
WHERE `barangkeluar`.`faktur` = '0204260001'